Repository: SSC-STUDIO/LenovoLegionToolkit-Plugins
Catalog: Plugins/NetworkAcceleration/Resources/Resource.*.resx
Languages: de, ja, ko, zh_hans, zh_hant

# NetworkAcceleration_PageTitle
source: Network Acceleration
de: Netzwerkbeschleunigung
ja: ネットワークアクセラレーション
ko: 네트워크 가속
zh_hans: 网络加速
zh_hant: 網路加速

# NetworkAcceleration_PageDescription
source: Real-time network acceleration and optimization features, including DNS optimization, request interception, and proxy acceleration.
de: Echtzeit-Netzwerkbeschleunigung und Optimierungsfunktionen, einschließlich DNS-Optimierung, Request-Interception und Proxy-Beschleunigung.
ja: リアルタイムネットワークアクセラレーションと最適化機能。DNS最適化、リクエストインターセプション、プロキシアクセラレーションなどの機能を含みます。
ko: 실시간 네트워크 가속 및 최적화 기능. DNS 최적화, 요청 가로채기, 프록시 가속 등의 기능을 포함합니다.
zh_hans: 实时网络加速和优化功能，包括 DNS 优化、请求拦截和代理加速等特性。
zh_hant: 即時網路加速和最佳化功能，包括 DNS 最佳化、請求攔截和代理加速等特性。

# NetworkAcceleration_ServiceStatus
source: Service Status
de: Dienststatus
ja: サービス状態
ko: 서비스 상태
zh_hans: 服务状态
zh_hant: 服務狀態

# NetworkAcceleration_ServiceStatusDescription
source: Running status of network acceleration service
de: Laufstatus des Netzwerkbeschleunigungsdienstes
ja: ネットワークアクセラレーションサービスの実行状態
ko: 네트워크 가속 서비스의 실행 상태
zh_hans: 网络加速服务的运行状态
zh_hant: 網路加速服務的運行狀態

# NetworkAcceleration_ServiceStatusRunning
source: Running
de: Läuft
ja: 実行中
ko: 실행 중
zh_hans: 运行中
zh_hant: 運行中

# NetworkAcceleration_ServiceStatusStopped
source: Stopped
de: Gestoppt
ja: 停止中
ko: 중지됨
zh_hans: 未运行
zh_hant: 未運行

# NetworkAcceleration_ServiceStatusRunningDescription
source: Network acceleration service is running, providing you with acceleration services
de: Netzwerkbeschleunigungsdienst läuft und stellt Ihnen Beschleunigungsdienste zur Verfügung
ja: ネットワークアクセラレーションサービスが実行中で、アクセラレーションサービスを提供しています
ko: 네트워크 가속 서비스가 실행 중이며 가속 서비스를 제공하고 있습니다
zh_hans: 网络加速服务正在运行，为您提供加速服务
zh_hant: 網路加速服務正在運行，為您提供加速服務

# NetworkAcceleration_ServiceStatusStoppedDescription
source: Network acceleration service is currently not running
de: Netzwerkbeschleunigungsdienst läuft derzeit nicht
ja: ネットワークアクセラレーションサービスは現在実行されていません
ko: 네트워크 가속 서비스가 현재 실행되고 있지 않습니다
zh_hans: 网络加速服务当前未运行
zh_hant: 網路加速服務當前未運行

# NetworkAcceleration_DnsOptimization
source: DNS Optimization
de: DNS-Optimierung
ja: DNS最適化
ko: DNS 최적화
zh_hans: DNS 优化
zh_hant: DNS 最佳化

# NetworkAcceleration_DnsOptimizationDescription
source: Intelligently resolves optimal domain IP addresses based on network conditions, solving DNS pollution issues
de: Intelligente Auflösung optimaler Domain-IP-Adressen basierend auf Netzwerkbedingungen, Lösung von DNS-Verschmutzungsproblemen
ja: ネットワーク状態に基づいて最適なドメインIPアドレスをインテリジェントに解決し、DNS汚染問題を解決します
ko: 네트워크 상태에 따라 최적의 도메인 IP 주소를 지능적으로 확인하여 DNS 오염 문제를 해결합니다
zh_hans: 根据网络状况智能解析最佳域名 IP 地址，解决 DNS 污染问题
zh_hant: 根據網路狀況智能解析最佳域名 IP 位址，解決 DNS 汙染問題

# NetworkAcceleration_DnsOptimizationEnabledDescription
source: Automatically selects the fastest DNS server for domain name resolution, improving access speed.
de: Wählt automatisch den schnellsten DNS-Server für die Domain-Namensauflösung aus und verbessert die Zugriffsgeschwindigkeit.
ja: 有効にすると、最速のDNSサーバーを自動的に選択してドメイン名解決を行い、アクセス速度を向上させます。
ko: 활성화하면 가장 빠른 DNS 서버를 자동으로 선택하여 도메인 이름 확인을 수행하고 접속 속도를 향상시킵니다.
zh_hans: 启用后会自动选择最快的 DNS 服务器进行域名解析，提升访问速度。
zh_hant: 啟用後會自動選擇最快的 DNS 伺服器進行域名解析，提升訪問速度。

# NetworkAcceleration_RequestInterception
source: Request Interception
ja: リクエストインターセプション
ko: 요청 가로채기
zh_hans: 请求拦截
zh_hant: 請求攔截

# NetworkAcceleration_RequestInterceptionDescription
source: Intercepts inaccessible websites and proxies to accelerated mirror sites
de: Interceptiert nicht erreichbare Webseiten und leitet sie an beschleunigte Mirror-Seiten weiter
ja: アクセス不可能なウェブサイトをインターセプトし、アクセラレーションミラーサイトにプロキシします
ko: 접근할 수 없는 웹사이트를 가로채서 가속 미러 사이트로 프록시합니다
zh_hans: 拦截无法访问的网站，代理到加速镜像站点
zh_hant: 攔截無法訪問的網站，代理到加速鏡像站點

# NetworkAcceleration_RequestInterceptionEnabledDescription
source: Automatically proxies inaccessible website requests to available accelerated mirror sites.
de: Leitet nicht erreichbare Webseitenanfragen automatisch an verfügbare beschleunigte Mirror-Seiten weiter.
ja: 有効にすると、アクセス不可能なウェブサイトリクエストを自動的に利用可能なアクセラレーションミラーサイトにプロキシします。
ko: 활성화하면 접근할 수 없는 웹사이트 요청을 사용 가능한 가속 미러 사이트로 자동 프록시합니다.
zh_hans: 启用后会自动将无法访问的网站请求代理到可用的加速镜像站点。
zh_hant: 啟用後會自動將無法訪問的網站請求代理到可用的加速鏡像站點。

# NetworkAcceleration_GithubAcceleration
source: GitHub Acceleration
de: GitHub-Beschleunigung
ja: GitHubアクセラレーション
ko: GitHub 가속
zh_hans: GitHub 加速
zh_hant: GitHub 加速

# NetworkAcceleration_GithubAccelerationDescription
source: GitHub direct connection acceleration, including Release, Clone, Raw downloads, etc.
de: GitHub-Direktverbindungsbeschleunigung, einschließlich Release, Clone, Raw-Downloads etc.
ja: GitHub直接接続アクセラレーション。Release、Clone、Rawなどのダウンロードを含みます
ko: GitHub 직접 연결 가속. Release, Clone, Raw 등 다운로드 포함
zh_hans: GitHub 直连加速，包括 Release、Clone、Raw 等下载加速
zh_hant: GitHub 直連加速，包括 Release、Clone、Raw 等下載加速

# NetworkAcceleration_GithubAccelerationEnabledDescription
source: Enable GitHub acceleration to improve GitHub access speed, including code cloning, file downloads, etc.
de: Aktiviert GitHub-Beschleunigung zur Verbesserung der GitHub-Zugriffsgeschwindigkeit, einschließlich Code-Klonen, Datei-Downloads etc.
ja: GitHubアクセラレーション機能を有効にし、コードクローン、ファイルダウンロードなどGitHubアクセス速度を向上させます。
ko: GitHub 가속 기능을 활성화하여 코드 클론, 파일 다운로드 등 GitHub 접속 속도를 향상시킵니다.
zh_hans: 启用 GitHub 加速功能，提升 GitHub 访问速度，包括代码克隆、文件下载等。
zh_hant: 啟用 GitHub 加速功能，提升 GitHub 訪問速度，包括代碼克隆、檔案下載等。

# NetworkAcceleration_GithubAccelerationShortDescription
source: Accelerate GitHub code repository and resource downloads
de: Beschleunigt GitHub-Code-Repository und Ressourcen-Downloads
ja: GitHubコードリポジトリとリソースのダウンロードを加速
ko: GitHub 코드 저장소 및 리소스 다운로드 가속
zh_hans: 加速 GitHub 代码仓库和资源下载
zh_hant: 加速 GitHub 代碼倉庫和資源下載

# NetworkAcceleration_ProxySettings
source: Proxy Settings
de: Proxy-Einstellungen
ja: プロキシ設定
ko: 프록시 설정
zh_hans: 代理设置
zh_hant: 代理設定

# NetworkAcceleration_ProxySettingsDescription
source: Configure network proxy server settings
de: Netzwerk-Proxy-Server-Einstellungen konfigurieren
ja: ネットワークプロキシサーバー設定を構成
ko: 네트워크 프록시 서버 설정 구성
zh_hans: 配置网络代理服务器设置
zh_hant: 配置網路代理伺服器設定

# NetworkAcceleration_ProxyAddress
source: Proxy Address:
de: Proxy-Adresse:
ja: プロキシアドレス：
ko: 프록시 주소:
zh_hans: 代理地址：
zh_hant: 代理位址：

# NetworkAcceleration_ProxyAddressPlaceholder
source: e.g., 127.0.0.1:7890
de: z.B. 127.0.0.1:7890
ja: 例：127.0.0.1:7890
ko: 예: 127.0.0.1:7890
zh_hans: 例如：127.0.0.1:7890
zh_hant: 例如：127.0.0.1:7890

# NetworkAcceleration_ProxyAddressDescription
source: Configure local proxy server address and port. Leave blank for default settings.
de: Lokale Proxy-Server-Adresse und Port konfigurieren. Leer lassen für Standardeinstellungen.
ja: ローカルプロキシサーバーのアドレスとポートを構成します。空白の場合はデフォルト設定を使用します。
ko: 로컬 프록시 서버 주소와 포트를 구성합니다. 비워두면 기본 설정을 사용합니다.
zh_hans: 配置本地代理服务器地址和端口。留空则使用默认设置。
zh_hant: 配置本地代理伺服器位址和埠號。留空則使用預設設定。

# NetworkAcceleration_AcceleratedTraffic
source: Accelerated Traffic
de: Beschleunigter Verkehr
ja: アクセラレーショントラフィック
ko: 가속 트래픽
zh_hans: 加速流量
zh_hant: 加速流量

# NetworkAcceleration_Downloaded
source: Downloaded
de: Heruntergeladen
ja: ダウンロード
ko: 다운로드
zh_hans: 下载
zh_hant: 下載

# NetworkAcceleration_Uploaded
source: Uploaded
de: Hochgeladen
ja: アップロード
ko: 업로드
zh_hans: 上传
zh_hant: 上傳

# NetworkAcceleration_TotalTraffic
source: Total Traffic
de: Gesamtverkehr
ja: 合計トラフィック
ko: 총 트래픽
zh_hans: 总流量
zh_hant: 總流量

# NetworkAcceleration_ResetStatistics
source: Reset
de: Zurücksetzen
ja: リセット
ko: 초기화
zh_hans: 重置
zh_hant: 重置

# NetworkAcceleration_Error_CertificateSetupFailed
source: Certificate Setup Failed
de: Zertifikat-Setup fehlgeschlagen
ja: 証明書セットアップ失敗
ko: 인증서 설정 실패
zh_hans: 证书设置失败
zh_hant: 證書設定失敗

# NetworkAcceleration_Error_CertificateSetupFailedDescription
source: Unable to setup root certificate, please check permissions
de: Root-Zertifikat kann nicht eingerichtet werden, bitte Berechtigungen überprüfen
ja: ルート証明書をセットアップできません。権限を確認してください
ko: 루트 인증서를 설정할 수 없습니다. 권한을 확인하세요
zh_hans: 无法设置根证书，请检查权限
zh_hant: 無法設定根證書，請檢查權限

# NetworkAcceleration_Error_ProxyServiceStartupFailed
source: Proxy Service Startup Failed
de: Proxy-Dienst-Start fehlgeschlagen
ja: プロキシサービス起動失敗
ko: 프록시 서비스 시작 실패
zh_hans: 代理服务启动失败
zh_hant: 代理服務啟動失敗

# NetworkAcceleration_Error_ProxyServiceStartupFailedDescription
source: Unable to start reverse proxy service
de: Reverse-Proxy-Dienst kann nicht gestartet werden
ja: リバースプロキシサービスを起動できません
ko: 역방향 프록시 서비스를 시작할 수 없습니다
zh_hans: 无法启动反向代理服务
zh_hant: 無法啟動反向代理服務

# NetworkAcceleration_Error_StartupFailed
source: Startup Failed
de: Start fehlgeschlagen
ja: 起動失敗
ko: 시작 실패
zh_hans: 启动失败
zh_hant: 啟動失敗

# NetworkAcceleration_Error_StartupFailedDescription
source: Error occurred while starting service: {0}
de: Fehler beim Starten des Dienstes: {0}
ja: サービス起動時にエラーが発生しました: {0}
ko: 서비스 시작 중 오류 발생: {0}
zh_hans: 启动服务时发生错误: {0}
zh_hant: 啟動服務時發生錯誤: {0}

# NetworkAcceleration_Error_StopFailed
source: Stop Failed
de: Stopp fehlgeschlagen
ja: 停止失敗
ko: 중지 실패
zh_hans: 停止失败
zh_hant: 停止失敗

# NetworkAcceleration_Error_StopFailedDescription
source: Error occurred while stopping service: {0}
de: Fehler beim Stoppen des Dienstes: {0}
ja: サービス停止時にエラーが発生しました: {0}
ko: 서비스 중지 중 오류 발생: {0}
zh_hans: 停止服务时发生错误: {0}
zh_hant: 停止服務時發生錯誤: {0}

# NetworkAcceleration_TrafficChart
source: Speed Chart
de: Geschwindigkeitsdiagramm
ja: 速度チャート
ko: 속도 차트
zh_hans: 速度图表
zh_hant: 速度圖表

# NetworkAcceleration_TrafficStatistics
source: Real-time Traffic Statistics and Trend Analysis
de: Echtzeit-Verkehrsstatistiken und Trendanalyse
ja: リアルタイムトラフィック統計とトレンド分析
ko: 실시간 트래픽 통계 및 트렌드 분석
zh_hans: 实时流量统计与趋势分析
zh_hant: 即時流量統計與趨勢分析

# NetworkAcceleration_TrafficChartDescription
source: Real-time display of download and upload speed changes
de: Echtzeitanzeige der Download- und Upload-Geschwindigkeitsänderungen
ja: ダウンロードとアップロード速度の変化をリアルタイム表示
ko: 다운로드 및 업로드 속도 변화를 실시간으로 표시
zh_hans: 实时显示下载和上传速度变化
zh_hant: 即時顯示下載和上傳速度變化

# NetworkAcceleration_ResetStatisticsButton
source: Reset Statistics
de: Statistiken zurücksetzen
ja: 統計をリセット
ko: 통계 초기화
zh_hans: 重置统计
zh_hant: 重置統計

# NetworkAcceleration_PlatformAcceleration
source: Platform Acceleration
de: Plattform-Beschleunigung
ja: プラットフォームアクセラレーション
ko: 플랫폼 가속
zh_hans: 平台加速
zh_hant: 平台加速

# NetworkAcceleration_PlatformAccelerationDescription
source: Enable network acceleration for the following platforms to improve access speed and stability
de: Netzwerkbeschleunigung für die folgenden Plattformen aktivieren, um Zugriffsgeschwindigkeit und -stabilität zu verbessern
ja: 次のプラットフォームでネットワークアクセラレーションを有効にし、アクセス速度と安定性を向上させます
ko: 다음 플랫폼에 대해 네트워크 가속을 활성화하여 접속 속도와 안정성을 향상시킵니다
zh_hans: 为以下平台启用网络加速，提升访问速度和稳定性
zh_hant: 為以下平台啟用網路加速，提升訪問速度和穩定性

# NetworkAcceleration_SteamAcceleration
source: Steam Acceleration
de: Steam-Beschleunigung
ja: Steamアクセラレーション
ko: Steam 가속
zh_hans: Steam 加速
zh_hant: Steam 加速

# NetworkAcceleration_SteamAccelerationDescription
source: Accelerate Steam store, community, and downloads
de: Steam-Store, Community und Downloads beschleunigen
ja: Steamストア、コミュニティ、ダウンロードを加速
ko: Steam 상점, 커뮤니티, 다운로드 가속
zh_hans: 加速 Steam 商店、社区和下载
zh_hant: 加速 Steam 商店、社群和下載

# NetworkAcceleration_DiscordAcceleration
source: Discord Acceleration
de: Discord-Beschleunigung
ja: Discordアクセラレーション
ko: Discord 가속
zh_hans: Discord 加速
zh_hant: Discord 加速

# NetworkAcceleration_DiscordAccelerationDescription
source: Accelerate Discord app and CDN resources
de: Discord-App und CDN-Ressourcen beschleunigen
ja: DiscordアプリとCDNリソースを加速
ko: Discord 앱 및 CDN 리소스 가속
zh_hans: 加速 Discord 应用和 CDN 资源
zh_hant: 加速 Discord 應用程式和 CDN 資源

# NetworkAcceleration_NpmAcceleration
source: NPM Acceleration
de: NPM-Beschleunigung
ja: NPMアクセラレーション
ko: NPM 가속
zh_hans: NPM 加速
zh_hant: NPM 加速

# NetworkAcceleration_NpmAccelerationDescription
source: Accelerate npm package manager downloads
de: npm-Paket-Manager-Downloads beschleunigen
ja: npmパッケージマネージャーダウンロードを加速
ko: npm 패키지 관리자 다운로드 가속
zh_hans: 加速 npm 包管理器下载
zh_hant: 加速 npm 套件管理器下載

# NetworkAcceleration_PythonAcceleration
source: Python Acceleration
de: Python-Beschleunigung
ja: Pythonアクセラレーション
ko: Python 가속
zh_hans: Python 加速
zh_hant: Python 加速

# NetworkAcceleration_PythonAccelerationDescription
source: Accelerate Python package index downloads
de: Python-Paket-Index-Downloads beschleunigen
ja: Pythonパッケージインデックスダウンロードを加速
ko: Python 패키지 인덱스 다운로드 가속
zh_hans: 加速 Python 包索引下载
zh_hant: 加速 Python 套件索引下載

# NetworkAcceleration_SteamAccelerationShortDescription
source: Accelerate Steam store, community, and downloads
de: Steam-Store, Community und Downloads beschleunigen
ja: Steamストア、コミュニティ、ダウンロードを加速
ko: Steam 상점, 커뮤니티, 다운로드 가속
zh_hans: 加速 Steam 商店、社区和下载
zh_hant: 加速 Steam 商店、社群和下載

# NetworkAcceleration_DiscordAccelerationShortDescription
source: Accelerate Discord app and CDN resources
de: Discord-App und CDN-Ressourcen beschleunigen
ja: DiscordアプリとCDNリソースを加速
ko: Discord 앱 및 CDN 리소스 가속
zh_hans: 加速 Discord 应用和 CDN 资源
zh_hant: 加速 Discord 應用程式和 CDN 資源

# NetworkAcceleration_NpmAccelerationShortDescription
source: Accelerate npm package manager downloads
de: npm-Paket-Manager-Downloads beschleunigen
ja: npmパッケージマネージャーダウンロードを加速
ko: npm 패키지 관리자 다운로드 가속
zh_hans: 加速 npm 包管理器下载
zh_hant: 加速 npm 套件管理器下載

# NetworkAcceleration_PythonAccelerationShortDescription
source: Accelerate Python package index downloads
de: Python-Paket-Index-Downloads beschleunigen
ja: Pythonパッケージインデックスダウンロードを加速
ko: Python 패키지 인덱스 다운로드 가속
zh_hans: 加速 Python 包索引下载
zh_hant: 加速 Python 套件索引下載

# NetworkAcceleration_ConnectionTimeout
source: Connection Timeout (seconds)
de: Verbindungs-Timeout (Sekunden)
ja: 接続タイムアウト（秒）
ko: 연결 시간 초과(초)
zh_hans: 连接超时（秒）
zh_hant: 連接超時（秒）

# NetworkAcceleration_ConnectionTimeoutDescription
source: Set the timeout for network requests in seconds
de: Timeout für Netzwerkanfragen in Sekunden einstellen
ja: ネットワークリクエストのタイムアウト時間を秒単位で設定
ko: 네트워크 요청의 시간 초과 시간을 초 단위로 설정
zh_hans: 设置网络请求的超时时间，单位为秒
zh_hant: 設定網路請求的超時時間，單位為秒

# NetworkAcceleration_ProxyPort
source: Proxy Port
ja: プロキシポート
ko: 프록시 포트
zh_hans: 代理端口
zh_hant: 代理埠號

# NetworkAcceleration_ProxyPortPlaceholder
source: e.g., 7890
de: z.B. 7890
ja: 例: 7890
ko: 예: 7890
zh_hans: 例如: 7890
zh_hant: 例如: 7890
