Repository: SSC-STUDIO/LenovoLegionToolkit-Plugins
Catalog: Plugins/ShellIntegration/Resources/Resource.*.resx
Languages: ko, nl_nl, zh_hans, zh_hant

# ShellIntegration_Name
source: Shell Integration
ko: Shell 통합
nl_nl: Shell 統合
zh_hans: Shell 集成
zh_hant: Shell 整合

# ShellIntegration_Description
source: Enhanced Windows Shell integration with context menu extensions and file management tools
ko: 우클릭 메뉴 확장 및 파일 관리 도구를 갖춘 확장 Windows Shell 통합
nl_nl: 右クリックメニュー拡張とファイル管理ツールを備えた拡張Windows Shell統合
zh_hans: 增强的 Windows Shell 集成，包含右键菜单扩展和文件管理工具
zh_hant: 增強的 Windows Shell 整合，包含右鍵選單擴展和檔案管理工具

# ServiceStatus_Title
source: Service Status
ko: 서비스 상태
nl_nl: サービスステータス
zh_hans: 服务状态
zh_hant: 服務狀態

# Installation_Label
source: Installation:
ko: 설치 상태：
nl_nl: インストール状況：
zh_hans: 安装状态：
zh_hant: 安裝狀態：

# Service_Label
source: Service:
ko: 서비스：
nl_nl: サービス：
zh_hans: 服务：
zh_hant: 服務：

# Version_Label
source: Version:
ko: 버전：
nl_nl: バージョン：
zh_hans: 版本：
zh_hant: 版本：

# QuickActions_Title
source: Quick Actions
ko: 빠른 작업
nl_nl: クイックアクション
zh_hans: 快速操作
zh_hant: 快速操作

# MenuSettings_Button
source: Menu Settings
ko: 메뉴 설정
nl_nl: メニュー設定
zh_hans: 菜单设置
zh_hant: 選單設定

# ExtensionSettings_Button
source: Extension Settings
ko: 확장 기능 설정
nl_nl: 拡張機能設定
zh_hans: 扩展设置
zh_hant: 擴展設定

# About_Title
source: About Shell Integration
ko: Shell 통합 정보
nl_nl: Shell 統合について
zh_hans: 关于 Shell 集成
zh_hant: 關於 Shell 整合

# Install_Button
source: Install
ko: 설치
nl_nl: インストール
zh_hans: 安装
zh_hant: 安裝

# Uninstall_Button
source: Uninstall
ko: 제거
nl_nl: アンインストール
zh_hans: 卸载
zh_hant: 解除安裝

# Start_Button
source: Start
ko: 시작
nl_nl: 開始
zh_hans: 启动
zh_hant: 啟動

# Stop_Button
source: Stop
ko: 중지
nl_nl: 停止
zh_hans: 停止
zh_hant: 停止

# Refresh_Button
source: Refresh
ko: 새로고침
nl_nl: 更新
zh_hans: 刷新
zh_hant: 重新整理

# ContextMenuItems_Title
source: Context Menu Items
ko: 우클릭 메뉴 항목
nl_nl: 右クリックメニュー項目
zh_hans: 右键菜单项
zh_hant: 右鍵選單項目

# ShellExtensions_Title
source: Shell Extensions
ko: Shell 확장 기능
nl_nl: Shell 拡張機能
zh_hans: Shell 扩展
zh_hant: Shell 擴展

# ResetToDefaults_Button
source: Reset to Defaults
ko: 기본값으로 재설정
nl_nl: デフォルトに戻す
zh_hans: 重置为默认
zh_hant: 重置為預設

# Name_Column
source: Name
ko: 이름
nl_nl: 名前
zh_hans: 名称
zh_hant: 名稱

# Category_Column
source: Category
ko: 범주
nl_nl: カテゴリー
zh_hans: 类别
zh_hant: 類別

# Command_Column
source: Command
ko: 명령
nl_nl: コマンド
zh_hans: 命令
zh_hant: 命令

# Type_Column
source: Type
ko: 유형
nl_nl: タイプ
zh_hans: 类型
zh_hant: 類型

# Version_Column
source: Version
ko: 버전
nl_nl: バージョン
zh_hans: 版本
zh_hant: 版本

# System_Column
source: System
ko: 시스템
nl_nl: システム
zh_hans: 系统
zh_hant: 系統

# Status_Column
source: Status
ko: 상태
nl_nl: ステータス
zh_hans: 状态
zh_hant: 狀態

# Status_Installed
source: Installed
ko: 설치됨
nl_nl: インストール済み
zh_hans: 已安装
zh_hant: 已安裝

# Status_NotInstalled
source: Not Installed
ko: 설치되지 않음
nl_nl: 未インストール
zh_hans: 未安装
zh_hant: 未安裝

# Status_Running
source: Running
ko: 실행 중
nl_nl: 実行中
zh_hans: 运行中
zh_hant: 執行中

# Status_Stopped
source: Stopped
ko: 중지됨
nl_nl: 停止済み
zh_hans: 已停止
zh_hant: 已停止

# Status_Error
source: Error
ko: 오류
nl_nl: エラー
zh_hans: 错误
zh_hant: 錯誤

# Success_Installed
source: Shell Integration installed successfully
ko: Shell 통합이 설치되었습니다
nl_nl: Shell 統合をインストールしました
zh_hans: Shell 集成安装成功
zh_hant: Shell 整合安裝成功

# Success_Uninstalled
source: Shell Integration uninstalled successfully
ko: Shell 통합이 제거되었습니다
nl_nl: Shell 統合をアンインストールしました
zh_hans: Shell 集成卸载成功
zh_hant: Shell 整合解除安裝成功

# Success_Started
source: Shell Integration started successfully
ko: Shell 통합이 시작되었습니다
nl_nl: Shell 統合を開始しました
zh_hans: Shell 集成启动成功
zh_hant: Shell 整合啟動成功

# Success_Stopped
source: Shell Integration stopped successfully
ko: Shell 통합이 중지되었습니다
nl_nl: Shell 統合を停止しました
zh_hans: Shell 集成停止成功
zh_hant: Shell 整合停止成功

# Success_MenuItemToggled
source: Menu item {0} {1}
ko: 메뉴 항목 {0} 이{1}
nl_nl: メニュー項目 {0} が{1}
zh_hans: 菜单项 {0} 已{1}
zh_hant: 選單項目 {0} 已{1}

# Success_ExtensionToggled
source: Extension {0} {1}
ko: 확장 기능 {0} 이{1}
nl_nl: 拡張機能 {0} が{1}
zh_hans: 扩展 {0} 已{1}
zh_hant: 擴展 {0} 已{1}

# Success_ResetToDefaults
source: Menu items reset to defaults
ko: 메뉴 항목이 기본값으로 재설정되었습니다
nl_nl: メニュー項目をデフォルトにリセットしました
zh_hans: 菜单项已重置为默认
zh_hant: 選單項目已重置為預設

# Error_InstallationFailed
source: Failed to install Shell Integration
ko: Shell 통합 설치 실패
nl_nl: Shell 統合のインストールに失敗しました
zh_hans: 安装 Shell 集成失败
zh_hant: 安裝 Shell 整合失敗

# Error_UninstallationFailed
source: Failed to uninstall Shell Integration
ko: Shell 통합 제거 실패
nl_nl: Shell 統合のアンインストールに失敗しました
zh_hans: 卸载 Shell 集成失败
zh_hant: 解除安裝 Shell 整合失敗

# Error_StartFailed
source: Failed to start Shell Integration
ko: Shell 통합 시작 실패
nl_nl: Shell 統合の開始に失敗しました
zh_hans: 启动 Shell 集成失败
zh_hant: 啟動 Shell 整合失敗

# Error_StopFailed
source: Failed to stop Shell Integration
ko: Shell 통합 중지 실패
nl_nl: Shell 統合の停止に失敗しました
zh_hans: 停止 Shell 集成失败
zh_hant: 停止 Shell 整合失敗

# Error_MenuItemToggleFailed
source: Failed to toggle menu item
ko: 메뉴 항목 전환 실패
nl_nl: メニュー項目の切り替えに失敗しました
zh_hans: 切换菜单项失败
zh_hant: 切換選單項目失敗

# Error_ExtensionToggleFailed
source: Failed to toggle extension
ko: 확장 기능 전환 실패
nl_nl: 拡張機能の切り替えに失敗しました
zh_hans: 切换扩展失败
zh_hant: 切換擴展失敗

# Error_ResetFailed
source: Failed to reset menu items
ko: 메뉴 항목 재설정 실패
nl_nl: メニュー項目のリセットに失敗しました
zh_hans: 重置菜单项失败
zh_hant: 重置選單項目失敗

# Confirm_Uninstall
source: Are you sure you want to uninstall Shell Integration? This will remove all context menu enhancements.
ko: Shell 통합을 제거하시겠습니까? 이렇게 하면 모든 우클릭 메뉴 확장 기능이 제거됩니다.
nl_nl: Shell 統合をアンインストールしてもよろしいですか？これによりすべての右クリックメニュー拡張機能が削除されます。
zh_hans: 确定要卸载 Shell 集成吗？这将移除所有右键菜单增强功能。
zh_hant: 確定要解除安裝 Shell 整合嗎？這將移除所有右鍵選單增強功能。

# Confirm_Reset
source: Are you sure you want to reset all menu items to default? This will remove any custom menu items you have added.
ko: 모든 메뉴 항목을 기본값으로 재설정하시겠습니까? 이렇게 하면 추가한 모든 사용자 정의 메뉴 항목이 제거됩니다.
nl_nl: すべてのメニュー項目をデフォルトにリセットしてもよろしいですか？これにより追加したカスタムメニュー項目が削除されます。
zh_hans: 确定要将所有菜单项重置为默认吗？这将移除您已添加的任何自定义菜单项。
zh_hant: 確定要將所有選單項目重置為預設嗎？這將移除您已添加的任何自定義選單項目。

# Tooltip_MenuSettings
source: Configure context menu items
ko: 우클릭 메뉴 항목 구성
nl_nl: 右クリックメニュー項目を設定
zh_hans: 配置右键菜单项
zh_hant: 設定右鍵選單項目

# Tooltip_ExtensionSettings
source: Manage shell extensions
ko: Shell 확장 기능 관리
nl_nl: Shell 拡張機能を管理
zh_hans: 管理 Shell 扩展
zh_hant: 管理 Shell 擴展

# About_Introduction
source: Shell Integration provides enhanced Windows context menu functionality with:
ko: Shell 통합은 확장된 Windows 우클릭 메뉴 기능을 제공합니다:
nl_nl: Shell 統合は拡張Windows右クリックメニュー機能を提供します：
zh_hans: Shell 集成提供增强的 Windows 右键菜单功能：
zh_hant: Shell 整合提供增強的 Windows 右鍵選單功能：

# About_Feature1
source: • Custom context menu items
ko: • 사용자 정의 우클릭 메뉴 항목
nl_nl: • カスタム右クリックメニュー項目
zh_hans: • 自定义右键菜单项
zh_hant: • 自定義右鍵選單項目

# About_Feature2
source: • Quick file operations
ko: • 빠른 파일 작업
nl_nl: • クイックファイル操作
zh_hans: • 快速文件操作
zh_hant: • 快速檔案操作

# About_Feature3
source: • Enhanced navigation options
ko: • 확장된 탐색 옵션
nl_nl: • 拡張ナビゲーションオプション
zh_hans: • 增强的导航选项
zh_hant: • 增強的導航選項

# About_Feature4
source: • Integration with system tools
ko: • 시스템 도구 통합
nl_nl: • システムツールとの統合
zh_hans: • 与系统工具集成
zh_hant: • 與系統工具整合

# About_Feature5
source: • Configurable menu items and extensions
ko: • 구성 가능한 메뉴 항목 및 확장 기능
nl_nl: • 設定可能なメニュー項目と拡張機能
zh_hans: • 可配置的菜单项和扩展
zh_hant: • 可配置的選單項目和擴展

# About_Note
source: Note: Some features may require administrator privileges to function properly.
ko: 참고: 일부 기능이 제대로 작동하려면 관리자 권한이 필요할 수 있습니다.
nl_nl: 注意：一部の機能には正常に動作するために管理者権限が必要な場合があります。
zh_hans: 注意：某些功能可能需要管理员权限才能正常运行。
zh_hant: 注意：某些功能可能需要管理員權限才能正常運行。

# Category_Navigation
source: Navigation
ko: 탐색
nl_nl: ナビゲーション
zh_hans: 导航
zh_hant: 導航

# Category_Utilities
source: Utilities
ko: 유틸리티
nl_nl: ユーティリティ
zh_hans: 工具
zh_hant: 工具

# Category_System
source: System
ko: 시스템
nl_nl: システム
zh_hans: 系统
zh_hant: 系統

# MenuItem_OpenTerminalHere
source: Open Terminal Here
ko: 여기에서 터미널 열기
nl_nl: ここでターミナルを開く
zh_hans: 在此处打开终端
zh_hant: 在此處開啟終端

# MenuItem_OpenTerminalHere_Desc
source: Open Windows Terminal in current directory
ko: 현재 디렉터리에서 Windows 터미널 열기
nl_nl: 現在のディレクトリでWindowsターミナルを開く
zh_hans: 在当前目录中打开 Windows 终端
zh_hant: 在目前目錄中開啟 Windows 終端

# MenuItem_OpenPowerShellHere
source: Open PowerShell Here
ko: 여기에서 PowerShell 열기
nl_nl: ここでPowerShellを開く
zh_hans: 在此处打开 PowerShell
zh_hant: 在此處開啟 PowerShell

# MenuItem_OpenPowerShellHere_Desc
source: Open PowerShell in current directory
ko: 현재 디렉터리에서 PowerShell 열기
nl_nl: 現在のディレクトリでPowerShellを開く
zh_hans: 在当前目录中打开 PowerShell
zh_hant: 在目前目錄中開啟 PowerShell

# MenuItem_CopyFilePath
source: Copy File Path
ko: 파일 경로 복사
nl_nl: ファイルパスをコピー
zh_hans: 复制文件路径
zh_hant: 複製檔案路徑

# MenuItem_CopyFilePath_Desc
source: Copy full file path to clipboard
ko: 전체 파일 경로를 클립보드에 복사
nl_nl: 完全なファイルパスをクリップボードにコピー
zh_hans: 复制完整文件路径到剪贴板
zh_hant: 複製完整檔案路徑到剪貼簿

# MenuItem_RunAsAdmin
source: Run as Administrator
ko: 관리자 권한으로 실행
nl_nl: 管理者として実行
zh_hans: 以管理员身份运行
zh_hant: 以系統管理員身份執行

# MenuItem_RunAsAdmin_Desc
source: Run selected program as administrator
ko: 선택한 프로그램을 관리자 권한으로 실행
nl_nl: 選択したプログラムを管理者として実行
zh_hans: 以管理员身份运行选定的程序
zh_hant: 以系統管理員身份執行選定的程式

# MenuItem_OpenFileLocation
source: Open File Location
ko: 파일 위치 열기
nl_nl: ファイルの場所を開く
zh_hans: 打开文件位置
zh_hant: 開啟檔案位置

# MenuItem_OpenFileLocation_Desc
source: Open folder containing the file
ko: 파일이 포함된 폴더 열기
nl_nl: ファイルを含むフォルダーを開く
zh_hans: 打开包含文件的文件夹
zh_hant: 開啟包含檔案的資料夾

# ShellIntegration_Category_Title
source: Shell Integration
ko: Shell 통합
nl_nl: Shell 統合
zh_hans: Shell 集成
zh_hant: Shell 整合

# ShellIntegration_Category_Description
source: Enhanced Windows Shell integration with context menu beautification and mouse style customization
ko: 우클릭 메뉴美化 및 마우스 스타일 사용자 정의를 갖춘 확장 Windows Shell 통합
nl_nl: 右クリックメニューの美化とマウススタイルカスタマイズを備えた拡張Windows Shell統合
zh_hans: 增强的 Windows Shell 集成，包含右键菜单美化和鼠标样式自定义
zh_hant: 增強的 Windows Shell 整合，包含右鍵選單美化和滑鼠樣式自定義

# ShellIntegration_Action_NilesoftShell_Enable_Title
source: Enable Modern Context Menu
ko: 모던 우클릭 메뉴 활성화
nl_nl: モダン右クリックメニューを有効化
zh_hans: 启用现代右键菜单
zh_hant: 啟用現代右鍵選單

# ShellIntegration_Action_NilesoftShell_Enable_Description
source: Enable Nilesoft Shell to beautify Windows context menu with modern style
ko: 모던 스타일로 Windows 우클릭 메뉴를美化하기 위해 Nilesoft Shell 활성화
nl_nl: モダンスタイルでWindows右クリックメニューを美化するためにNilesoft Shellを有効化
zh_hans: 启用 Nilesoft Shell 以美化 Windows 右键菜单，使用现代风格
zh_hant: 啟用 Nilesoft Shell 以美化 Windows 右鍵選單，使用現代風格

# ShellIntegration_Action_NilesoftShell_Uninstall_Title
source: Disable Modern Context Menu
ko: 모던 우클릭 메뉴 비활성화
nl_nl: モダン右クリックメニューを無効化
zh_hans: 禁用现代右键菜单
zh_hant: 停用現代右鍵選單

# ShellIntegration_Action_NilesoftShell_Uninstall_Description
source: Unregister Nilesoft Shell and restore default Windows context menu
ko: Nilesoft Shell 등록 취소 및 Windows 기본 우클릭 메뉴 복원
nl_nl: Nilesoft Shellの登録を解除し、Windowsデフォルトの右クリックメニューを復元
zh_hans: 注销 Nilesoft Shell 并恢复默认的 Windows 右键菜单
zh_hant: 取消註冊 Nilesoft Shell 並恢復預設的 Windows 右鍵選單

# ShellIntegration_Action_ContextMenuAnimations_Title
source: Disable Context Menu Animations
ko: 우클릭 메뉴 애니메이션 비활성화
nl_nl: 右クリックメニューアニメーションを無効化
zh_hans: 禁用上下文菜单动画
zh_hant: 停用右鍵選單動畫

# ShellIntegration_Action_ContextMenuAnimations_Description
source: Speed up context menu display by disabling animations
ko: 애니메이션 비활성화로 우클릭 메뉴 표시 가속화
nl_nl: アニメーションを無効化して右クリックメニュー表示を高速化
zh_hans: 通过禁用动画加速上下文菜单显示
zh_hant: 透過停用動畫加速右鍵選單顯示

# ShellIntegration_Action_ShowFileExtensions_Title
source: Show File Extensions
ko: 파일 확장자 표시
nl_nl: ファイル拡張子を表示
zh_hans: 显示文件扩展名
zh_hant: 顯示檔案副檔名

# ShellIntegration_Action_ShowFileExtensions_Description
source: Display file extensions for all files in File Explorer
ko: 파일 탐색기에서 모든 파일의 확장자 표시
nl_nl: ファイルエクスプローラーですべてのファイルの拡張子を表示
zh_hans: 在文件资源管理器中显示所有文件的扩展名
zh_hant: 在檔案總管中顯示所有檔案的副檔名

# ShellIntegration_Action_ShowHiddenFiles_Title
source: Show Hidden Files
ko: 숨김 파일 표시
nl_nl: 隠しファイルを表示
zh_hans: 显示隐藏文件
zh_hant: 顯示隱藏檔案

# ShellIntegration_Action_ShowHiddenFiles_Description
source: Show hidden files and folders in File Explorer
ko: 파일 탐색기에서 숨김 파일 및 폴더 표시
nl_nl: ファイルエクスプローラーで隠しファイルとフォルダーを表示
zh_hans: 在文件资源管理器中显示隐藏的文件和文件夹
zh_hant: 在檔案總管中顯示隱藏的檔案和資料夾

# ShellIntegration_Action_QuickAccess_Title
source: Use Quick Access in Explorer
ko: 빠른 접근 사용
nl_nl: クイックアクセスを使用
zh_hans: 使用快速访问
zh_hant: 使用快速存取

# ShellIntegration_Action_QuickAccess_Description
source: Set File Explorer to open to Quick Access by default
ko: 파일 탐색기를 기본적으로 빠른 접근으로 열기
nl_nl: ファイルエクスプローラーをデフォルトでクイックアクセスに設定
zh_hans: 设置文件资源管理器默认打开快速访问
zh_hant: 設定檔案總管預設開啟快速存取

# ShellIntegration_Action_PreviewPane_Title
source: Enable Preview Pane
ko: 미리보기 창 활성화
nl_nl: プレビューパネルを有効化
zh_hans: 启用预览窗格
zh_hant: 啟用預覽窗格

# ShellIntegration_Action_PreviewPane_Description
source: Show file preview in File Explorer
ko: 파일 탐색기에서 파일 미리보기 표시
nl_nl: ファイルエクスプローラーでファイルプレビューを表示
zh_hans: 在文件资源管理器中显示文件预览
zh_hant: 在檔案總管中顯示檔案預覽

# ShellIntegration_Action_MouseStyle_W11CC_Title
source: Apply Windows 11 Cursor Style
ko: Windows 11 커서 스타일 적용
nl_nl: Windows 11 カーソルスタイルを適用
zh_hans: 应用 Windows 11 光标样式
zh_hant: 套用 Windows 11 游標樣式

# ShellIntegration_Action_MouseStyle_W11CC_Description
source: Apply Windows 11 style cursor theme with high DPI support
ko: 고 DPI 지원을 갖춘 Windows 11 스타일 커서 테마 적용
nl_nl: 高DPI対応のWindows 11スタイルカーソルテーマを適用
zh_hans: 应用 Windows 11 风格的光标主题，支持高 DPI
zh_hant: 套用 Windows 11 風格的游標主題，支援高 DPI
