Repository: SSC-STUDIO/LenovoLegionToolkit-Plugins
Catalog: Plugins/ViveTool/Resources/Resource.*.resx
Languages: de, ja, ko, zh_hans, zh_hant

# ViveTool_PageDescription
source: Manage Windows feature flags using ViVeTool. Enable or disable experimental Windows features.
de: Windows-Feature-Flags mit ViVeTool verwalten. Experimentelle Windows-Funktionen aktivieren oder deaktivieren.
ja: ViVeToolを使用してWindows機能フラグを管理します。実験的なWindows機能を有効または無効にします。
ko: ViVeTool을 사용하여 Windows 기능 플래그를 관리합니다. 실험적 Windows 기능을 활성화 또는 비활성화합니다.
zh_hans: 使用 ViVeTool 管理 Windows 功能标志。启用或禁用实验性 Windows 功能。
zh_hant: 使用 ViVeTool 管理 Windows 功能標誌。啟用或停用實驗性 Windows 功能。

# ViveTool_WarningTitle
source: Warning
de: Warnung
ja: 警告
ko: 경고
zh_hans: 警告
zh_hant: 警告

# ViveTool_WarningMessage
source: Modifying Windows feature flags can affect system stability. Use with caution. Some changes may require a system restart to take effect.
de: Das Ändern von Windows-Feature-Flags kann die Systemstabilität beeinträchtigen. Mit Vorsicht verwenden. Einige Änderungen erfordern möglicherweise einen Systemneustart, um wirksam zu werden.
ja: Windows機能フラグを変更するとシステムの安定性に影響する可能性があります。慎重に使用してください。一部の変更にはシステムの再起動が必要な場合があります。
ko: Windows 기능 플래그를 수정하면 시스템 안정성에 영향을 줄 수 있습니다. 신중하게 사용하세요. 일부 변경 사항은 시스템 재부팅이 필요할 수 있습니다.
zh_hans: 修改 Windows 功能标志可能影响系统稳定性。请谨慎使用。某些更改可能需要重启系统才能生效。
zh_hant: 修改 Windows 功能標誌可能影響系統穩定性。請謹慎使用。某些變更可能需要系統重新啟動才能生效。

# ViveTool_ViveToolStatus
source: ViVeTool Status
ja: ViVeTool状態
ko: ViVeTool 상태
zh_hans: ViVeTool 状态
zh_hant: ViVeTool 狀態

# ViveTool_ViveToolFound
source: ViVeTool found at: {0}
de: ViVeTool gefunden unter: {0}
ja: ViVeToolが見つかりました: {0}
ko: ViVeTool을 찾았습니다: {0}
zh_hans: ViVeTool 已找到，路径：{0}
zh_hant: 找到 ViVeTool：{0}

# ViveTool_ViveToolNotFound
source: ViVeTool not found. Please download vivetool.exe and place it in the plugin directory or system PATH.
de: ViVeTool nicht gefunden. Bitte vivetool.exe herunterladen und im Plugin-Verzeichnis oder im System-PATH platzieren.
ja: ViVeToolが見つかりません。vivetool.exeをダウンロードし、プラグインディレクトリまたはシステムPATHに配置してください。
ko: ViVeTool을 찾을 수 없습니다. vivetool.exe를 다운로드하여 플러그인 디렉터리나 시스템 PATH에 배치하세요.
zh_hans: 未找到 ViVeTool。请下载 vivetool.exe 并将其放置在插件目录或系统 PATH 中。
zh_hant: 未找到 ViVeTool。請下載 vivetool.exe 並將其放置在插件目錄或系統 PATH 中。

# ViveTool_ViveToolError
source: Error checking ViVeTool status
de: Fehler beim Überprüfen des ViVeTool-Status
ja: ViVeTool状態のチェック中にエラーが発生しました
ko: ViVeTool 상태 확인 중 오류
zh_hans: 检查 ViVeTool 状态时出错
zh_hant: 檢查 ViVeTool 狀態時發生錯誤

# ViveTool_Refresh
source: Refresh
de: Aktualisieren
ja: 更新
ko: 새로고침
zh_hans: 刷新
zh_hant: 重新整理

# ViveTool_SearchFeatures
source: Search Features
de: Features suchen
ja: 機能を検索
ko: 기능 검색
zh_hans: 搜索功能
zh_hant: 搜尋功能

# ViveTool_SearchPlaceholder
source: Enter feature ID or name to search...
de: Feature-ID oder Namen eingeben zum Suchen...
ja: 機能IDまたは名前を入力して検索...
ko: 검색할 기능 ID나 이름을 입력하세요...
zh_hans: 输入功能 ID 或名称进行搜索...
zh_hant: 輸入功能 ID 或名稱進行搜尋...

# ViveTool_Search
source: Search
de: Suchen
ja: 検索
ko: 검색
zh_hans: 搜索
zh_hant: 搜尋

# ViveTool_FeatureFlags
source: Feature Flags
ja: 機能フラグ
ko: 기능 플래그
zh_hans: 功能标志
zh_hant: 功能標誌

# ViveTool_RefreshList
source: Refresh List
de: Liste aktualisieren
ja: リストを更新
ko: 목록 새로고침
zh_hans: 刷新列表
zh_hant: 重新整理清單

# ViveTool_Loading
source: Loading...
de: Laden...
ja: 読み込み中...
ko: 로딩 중...
zh_hans: 加载中...
zh_hant: 載入中...

# ViveTool_FeatureName
source: Name
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

# ViveTool_Status
source: Status
ja: 状態
ko: 상태
zh_hans: 状态
zh_hant: 狀態

# ViveTool_Actions
source: Actions
de: Aktionen
ja: アクション
ko: 작업
zh_hans: 操作
zh_hant: 動作

# ViveTool_Enable
source: Enable
de: Aktivieren
ja: 有効化
ko: 활성화
zh_hans: 启用
zh_hant: 啟用

# ViveTool_Disable
source: Disable
de: Deaktivieren
ja: 無効化
ko: 비활성화
zh_hans: 禁用
zh_hant: 停用

# ViveTool_NoFeaturesFound
source: No features found
de: Keine Features gefunden
ja: 機能が見つかりません
ko: 기능을 찾을 수 없습니다
zh_hans: 未找到功能
zh_hant: 未找到任何功能

# ViveTool_FeatureEnabled
source: Feature Enabled
de: Feature aktiviert
ja: 機能が有効化されました
ko: 기능이 활성화됨
zh_hans: 功能已启用
zh_hant: 功能已啟用

# ViveTool_FeatureEnabledMessage
source: Feature {0} has been enabled successfully
de: Feature {0} wurde erfolgreich aktiviert
ja: 機能{0}が正常に有効化されました
ko: 기능 {0}이(가) 성공적으로 활성화되었습니다
zh_hans: 功能 {0} 已成功启用
zh_hant: 功能 {0} 已成功啟用

# ViveTool_FeatureDisabled
source: Feature Disabled
de: Feature deaktiviert
ja: 機能が無効化されました
ko: 기능이 비활성화됨
zh_hans: 功能已禁用
zh_hant: 功能已停用

# ViveTool_FeatureDisabledMessage
source: Feature {0} has been disabled successfully
de: Feature {0} wurde erfolgreich deaktiviert
ja: 機能{0}が正常に無効化されました
ko: 기능 {0}이(가) 성공적으로 비활성화되었습니다
zh_hans: 功能 {0} 已成功禁用
zh_hant: 功能 {0} 已成功停用

# ViveTool_Error
source: Error
de: Fehler
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# ViveTool_EnableFeatureFailed
source: Failed to enable feature {0}. Please check administrator permissions.
de: Feature {0} konnte nicht aktiviert werden. Bitte Administratorberechtigungen überprüfen.
ja: 機能{0}の有効化に失敗しました。管理者権限を確認してください。
ko: 기능 {0} 활성화 실패. 관리자 권한을 확인하세요.
zh_hans: 启用功能 {0} 失败。请检查管理员权限。
zh_hant: 啟用功能 {0} 失敗。請檢查管理員權限。

# ViveTool_DisableFeatureFailed
source: Failed to disable feature {0}. Please check administrator permissions.
de: Feature {0} konnte nicht deaktiviert werden. Bitte Administratorberechtigungen überprüfen.
ja: 機能{0}の無効化に失敗しました。管理者権限を確認してください。
ko: 기능 {0} 비활성화 실패. 관리자 권한을 확인하세요.
zh_hans: 禁用功能 {0} 失败。请检查管理员权限。
zh_hant: 停用功能 {0} 失敗。請檢查管理員權限。

# ViveTool_Import
source: Import
de: Importieren
ja: インポート
ko: 가져오기
zh_hans: 导入
zh_hant: 匯入

# ViveTool_ImportFromFile
source: Import from File
de: Aus Datei importieren
ja: ファイルからインポート
ko: 파일에서 가져오기
zh_hans: 从文件导入
zh_hant: 從檔案匯入

# ViveTool_ImportFromUrl
source: Import from URL
de: Aus URL importieren
ja: URLからインポート
ko: URL에서 가져오기
zh_hans: 从 URL 导入
zh_hant: 從 URL 匯入

# ViveTool_ImportDescription
source: Import feature flags from a file or URL. Supported formats: JSON, CSV, or plain text (one ID per line).
de: Feature-Flags aus Datei oder URL importieren. Unterstützte Formate: JSON, CSV oder Klartext (eine ID pro Zeile).
ja: ファイルまたはURLから機能フラグをインポートします。サポートされている形式: JSON、CSV、またはプレーンテキスト（1行に1つのID）。
ko: 파일이나 URL에서 기능 플래그를 가져옵니다. 지원되는 형식: JSON, CSV, 또는 일반 텍스트(한 줄에 ID 하나).
zh_hans: 从文件或 URL 导入功能标志。支持的格式：JSON、CSV 或纯文本（每行一个 ID）。
zh_hant: 從檔案或 URL 匯入功能標誌。支援格式：JSON、CSV 或純文字（每行一個 ID）。

# ViveTool_ImportUrlDescription
source: Enter the URL to import feature flags from:
de: URL zum Importieren von Feature-Flags eingeben:
ja: 機能フラグをインポートするURLを入力してください:
ko: 기능 플래그를 가져올 URL을 입력하세요:
zh_hans: 输入要导入功能标志的 URL：
zh_hant: 輸入要匯入功能標誌的 URL：

# ViveTool_ImportSuccess
source: Import Successful
de: Import erfolgreich
ja: インポート成功
ko: 가져오기 성공
zh_hans: 导入成功
zh_hant: 匯入成功

# ViveTool_ImportSuccessMessage
source: Successfully imported {0} feature flag(s)
de: {0} Feature-Flag(s) erfolgreich importiert
ja: {0}個の機能フラグを正常にインポートしました
ko: {0}개의 기능 플래그를 성공적으로 가져왔습니다
zh_hans: 成功导入 {0} 个功能标志
zh_hant: 成功匯入 {0} 個功能標誌

# ViveTool_ImportFailed
source: Failed to import features: {0}
de: Importieren der Features fehlgeschlagen: {0}
ja: 機能のインポートに失敗しました: {0}
ko: 기능 가져오기 실패: {0}
zh_hans: 导入功能标志失败：{0}
zh_hant: 匯入功能失敗：{0}

# ViveTool_InvalidUrl
source: Invalid URL. Please enter a valid URL.
de: Ungültige URL. Bitte eine gültige URL eingeben.
ja: 無効なURLです。有効なURLを入力してください。
ko: 잘못된 URL입니다. 유효한 URL을 입력하세요.
zh_hans: 无效的 URL。请输入有效的 URL。
zh_hant: 無效的 URL。請輸入有效的 URL。

# ViveTool_Cancel
source: Cancel
de: Abbrechen
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# ViveTool_Browse
source: Browse
de: Durchsuchen
ja: 参照
ko: 찾아보기
zh_hans: 浏览
zh_hant: 瀏覽

# ViveTool_SelectViveTool
source: Select vivetool.exe
de: vivetool.exe auswählen
ja: vivetool.exeを選択
ko: vivetool.exe 선택
zh_hans: 选择 vivetool.exe
zh_hant: 選擇 vivetool.exe

# ViveTool_InvalidViveToolFile
source: Please select vivetool.exe file
de: Bitte vivetool.exe-Datei auswählen
ja: vivetool.exeファイルを選択してください
ko: vivetool.exe 파일을 선택하세요
zh_hans: 请选择 vivetool.exe 文件
zh_hant: 請選擇 vivetool.exe 檔案

# ViveTool_PathSet
source: Path Set
de: Pfad gesetzt
ja: パスが設定されました
ko: 경로가 설정됨
zh_hans: 路径已设置
zh_hant: 路徑已設定

# ViveTool_PathSetMessage
source: ViVeTool path has been set to: {0}
de: ViVeTool-Pfad wurde gesetzt auf: {0}
ja: ViVeToolパスが{0}に設定されました
ko: ViVeTool 경로가 {0}(으)로 설정되었습니다
zh_hans: ViVeTool 路径已设置为：{0}
zh_hant: ViVeTool 路徑已設定為：{0}

# ViveTool_SetPathFailed
source: Failed to set ViVeTool path: {0}
de: Fehler beim Setzen des ViVeTool-Pfades: {0}
ja: ViVeToolパスの設定に失敗しました: {0}
ko: ViVeTool 경로 설정 실패: {0}
zh_hans: 设置 ViVeTool 路径失败：{0}
zh_hant: 設定 ViVeTool 路徑失敗：{0}

# ViveTool_Download
source: Download
de: Herunterladen
ja: ダウンロード
ko: 다운로드
zh_hans: 下载
zh_hant: 下載

# ViveTool_PathPlaceholder
source: ViVeTool.exe Path
de: ViVeTool.exe-Pfad
ja: ViVeTool.exeパス
ko: ViVeTool.exe 경로
zh_hans: ViVeTool.exe 路径
zh_hant: ViVeTool.exe 路徑

# ViveTool_PathDescription
source: Select the path to the ViVeTool.exe file. If not specified, the built-in download or the version in the system PATH will be used.
de: Pfad zur ViVeTool.exe-Datei auswählen. Falls nicht angegeben, wird der integrierte Download oder die Version im System-PATH verwendet.
ja: ViVeTool.exeファイルのパスを選択します。指定されていない場合、内蔵ダウンロードまたはシステムPATHのバージョンが使用されます。
ko: ViVeTool.exe 파일의 경로를 선택합니다. 지정하지 않으면 내장 다운로드나 시스템 PATH의 버전을 사용합니다.
zh_hans: 选择 ViVeTool.exe 文件的路径。如果未指定，将使用内置下载或系统 PATH 中的版本。
zh_hant: 選擇 ViVeTool.exe 檔案的路徑。如果未指定，將使用內建下載或系統 PATH 中的版本。

# ViveTool_BrowseError
source: Error browsing files: {0}
de: Fehler beim Durchsuchen von Dateien: {0}
ja: ファイル参照中にエラーが発生しました: {0}
ko: 파일 찾아보기 중 오류: {0}
zh_hans: 浏览文件时出错: {0}
zh_hant: 瀏覽檔案時發生錯誤：{0}

# ViveTool_Downloading
source: Downloading ViVeTool...
de: ViVeTool wird heruntergeladen...
ja: ViVeToolをダウンロード中...
ko: ViVeTool 다운로드 중...
zh_hans: 正在下载 ViVeTool...
zh_hant: 正在下載 ViVeTool...

# ViveTool_StatusEnabled
source: Enabled
de: Aktiviert
ja: 有効
ko: 활성화됨
zh_hans: 已启用
zh_hant: 已啟用

# ViveTool_StatusDisabled
source: Disabled
de: Deaktiviert
ja: 無効
ko: 비활성화됨
zh_hans: 已禁用
zh_hant: 已停用

# ViveTool_StatusDefault
source: Default
de: Standard
ja: デフォルト
ko: 기본값
zh_hans: 默认
zh_hant: 預設

# ViveTool_StatusUnknown
source: Unknown
de: Unbekannt
ja: 不明
ko: 알 수 없음
zh_hans: 未知
zh_hant: 未知

# ViveTool_MissingToolMessage
source: ViVeTool not found. Please configure it in the settings.
zh_hans: 未找到 ViVeTool。请前往配置页面进行设置。
zh_hant: 未找到 ViVeTool。請前往設定頁面進行設定。

# ViveTool_GoToSettings
source: Go to Settings
zh_hans: 前往配置
zh_hant: 前往設定

# ViveTool_ImportConfig
source: Import Config
zh_hans: 导入配置

# ViveTool_ImportConfigTitle
source: Import Configuration
zh_hans: 导入配置

# ViveTool_ImportConfigDescription
source: Import ViVeTool configuration from a local file. This will load feature flags and their settings.
zh_hans: 从本地文件导入 ViVeTool 配置。这将加载功能标志及其设置。

# ViveTool_ConfigImportSuccess
source: Configuration Imported
zh_hans: 配置已导入

# ViveTool_ConfigImportSuccessMessage
source: Successfully imported {0} feature configurations from {1}
zh_hans: 成功从 {1} 导入了 {0} 个功能配置

# ViveTool_ConfigImportFailed
source: Import Failed
zh_hans: 导入失败

# ViveTool_ConfigImportFailedMessage
source: Failed to import configuration: {0}
zh_hans: 导入配置失败：{0}

# ViveTool_DownloadProgress
source: Downloading: {0} / {1} ({2}%)
de: Herunterladen: {0} / {1} ({2}%)
ja: ダウンロード中: {0} / {1} ({2}%)
ko: 다운로드 중: {0} / {1} ({2}%)
zh_hant: 下載中：{0} / {1} ({2}%)

# ViveTool_DownloadComplete
source: Download Complete
de: Download abgeschlossen
ja: ダウンロード完了
ko: 다운로드 완료
zh_hant: 下載完成

# ViveTool_DownloadCompleteMessage
source: ViVeTool has been downloaded to {0}
de: ViVeTool wurde nach {0} heruntergeladen
ja: ViVeToolが{0}にダウンロードされました
ko: ViVeTool이 {0}에 다운로드되었습니다
zh_hant: ViVeTool 已下載至 {0}

# ViveTool_DownloadFailed
source: Download Failed
de: Download fehlgeschlagen
ja: ダウンロード失敗
ko: 다운로드 실패
zh_hant: 下載失敗
