Repository: SSC-STUDIO/LenovoLegionToolkit-Plugins
Catalog: Plugins/CustomMouse/Resources/Resource.*.resx
Languages: de, es, fr, ja, ko, ru, zh_hans

# CustomMouse_PluginName
source: Custom Mouse
de: Benutzerdefinierte Maus
es: Mouse Personalizado
fr: Souris Personnalisée
ja: カスタムマウス
ko: 사용자 정의 마우스
ru: Mouse Personalizado
zh_hans: 自定义鼠标

# CustomMouse_PluginDescription
source: Custom mouse cursor plugin with smart color detection and multiple cursor themes
de: Benutzerdefiniertes Mauszeiger-Plugin mit intelligenter Farberkennung und mehreren Cursor-Designs
es: Plugin de cursor de ratón personalizado con detección inteligente de color y múltiples temas de cursor
fr: Plugin de curseur de souris personnalisé avec détection intelligente des couleurs et plusieurs thèmes de curseur
ja: スマートカラー検出と複数のカーソルテーマに対応したカスタムマウスカーソルプラグイン
ko: 스마트 색상 감지와 다양한 커서 테마를 지원하는 사용자 정의 마우스 커서 플러그인
ru: Plugin de cursor de rato personalizado com detecção inteligente de cores e vários temas de cursor
zh_hans: 自定义鼠标样式插件，支持智能颜色检测和多种光标主题

# CustomMouse_ExtensionTitle
source: Mouse Style Extension
de: Mausstil-Erweiterung
es: Extensión de Estilo de Mouse
fr: Extension de Style de Souris
ja: マウススタイル拡張
ko: 마우스 스타일 확장
ru: Extensão de Estilo de Mouse
zh_hans: 鼠标样式扩展

# CustomMouse_PageTitle
source: Custom Mouse Styles
de: Benutzerdefinierte Mausstile
es: Estilos de Mouse Personalizados
fr: Styles de Souris Personnalisés
ja: カスタムマウススタイル
ko: 사용자 정의 마우스 스타일
ru: Estilos de Mouse Personalizados
zh_hans: 自定义鼠标样式

# CustomMouse_PageDescription
source: Customize mouse cursor styles with smart theme switching and multiple preset styles
de: Passen Sie Mauszeigerstile mit intelligenter Themenumschaltung und mehreren Voreinstellungen an
es: Personaliza los estilos de cursor de ratón con cambio inteligente de tema y múltiples estilos preestablecidos
fr: Personnalisez les styles de curseur de souris avec commutation intelligente de thème et plusieurs styles prédéfinis
ja: スマートテーマ切り替えと複数のプリセットスタイルでマウスカーソルスタイルをカスタマイズ
ko: 스마트 테마 전환 및 다양한 프리셋 스타일로 마우스 커서 스타일 커스터마이즈
ru: Personalize estilos de cursor de rato com alternância inteligente de tema e vários estilos predefinidos
zh_hans: 自定义鼠标光标样式，支持智能主题切换和多种预设样式

# CustomMouse_SettingsTitle
source: Mouse Settings
de: Mauseinstellungen
es: Configuración de Mouse
fr: Paramètres de Souris
ja: マウス設定
ko: 마우스 설정
ru: Configurações do Mouse
zh_hans: 鼠标设置

# CustomMouse_CurrentStyle
source: Current Style
de: Aktueller Stil
es: Estilo Actual
fr: Style Actuel
ja: 現在のスタイル
ko: 현재 스타일
ru: Estilo Atual
zh_hans: 当前样式

# CustomMouse_AutoColorDetection
source: Auto Color Detection
de: Automatische Farberkennung
es: Detección Automática de Color
fr: Détection Automatique des Couleurs
ja: 自動色検出
ko: 자동 색상 감지
ru: Detecção Automática de Cores
zh_hans: 自动颜色检测

# CustomMouse_AutoColorDetection_Description
source: Automatically select appropriate mouse cursor theme based on background color
de: Automatisch passendes Mauszeiger-Design basierend auf der Hintergrundfarbe auswählen
es: Seleccionar automáticamente el tema de cursor apropiado según el color de fondo
fr: Sélectionner automatiquement le thème de curseur approprié en fonction de la couleur d'arrière-plan
ja: 背景色に基づいて適切なマウスカーソルテーマを自動的に選択
ko: 배경색에 따라 적절한 마우스 커서 테마를 자동으로 선택
ru: Selecionar automaticamente o tema de cursor apropriado com base na cor de fundo
zh_hans: 根据背景颜色自动选择合适的鼠标光标主题

# CustomMouse_ThemeMode
source: Theme Mode
de: Designmodus
es: Modo de Tema
fr: Mode Thème
ja: テーマモード
ko: 테마 모드
ru: Modo de Tema
zh_hans: 主题模式

# CustomMouse_ThemeMode_Auto
source: Auto
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 자동
ru: Automático
zh_hans: 自动

# CustomMouse_ThemeMode_Light
source: Light
de: Hell
es: Claro
fr: Clair
ja: ライト
ko: 라이트
ru: Claro
zh_hans: 浅色

# CustomMouse_ThemeMode_Dark
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre
ja: ダーク
ko: 다크
ru: Escuro
zh_hans: 深色

# CustomMouse_BrightnessThreshold
source: Brightness Threshold
de: Helligkeitsschwellenwert
es: Umbral de Brillo
fr: Seuil de Luminosité
ja: 亮度閾値
ko: 밝기 임계값
ru: Limiar de Brilho
zh_hans: 亮度阈值

# CustomMouse_BrightnessThreshold_Description
source: Threshold for determining background color brightness (0.0-1.0)
de: Schwellenwert zur Bestimmung der Hintergrundfarbenhelligkeit (0.0-1.0)
es: Umbral para determinar el brillo del color de fondo (0.0-1.0)
fr: Seuil pour déterminer la luminosité de la couleur d'arrière-plan (0.0-1.0)
ja: 背景色の明るさを判断するための閾値（0.0-1.0）
ko: 배경색 밝기를 판단하기 위한 임계값 (0.0-1.0)
ru: Limiar para determinar o brilho da cor de fundo (0.0-1.0)
zh_hans: 用于判断背景颜色亮度的阈值（0.0-1.0）

# CustomMouse_PluginMode
source: Plugin Mode
de: Plugin-Modus
es: Modo de Plugin
fr: Mode Plugin
ja: プラグインモード
ko: 플러그인 모드
ru: Modo de Plugin
zh_hans: 插件模式

# CustomMouse_PluginMode_Extension
source: Extension Mode
de: Erweiterungsmodus
es: Modo de Extensión
fr: Mode Extension
ja: 拡張モード
ko: 확장 모드
ru: Modo de Extensão
zh_hans: 扩展模式

# CustomMouse_PluginMode_Independent
source: Independent Mode
de: Unabhängiger Modus
es: Modo Independiente
fr: Mode Indépendant
ja: 独立モード
ko: 독립 모드
ru: Modo Independente
zh_hans: 独立模式

# CustomMouse_EnablePreview
source: Enable Preview
de: Vorschau aktivieren
es: Habilitar Vista Previa
fr: Activer l'Aperçu
ja: プレビューを有効化
ko: 미리보기 활성화
ru: Ativar Pré-visualização
zh_hans: 启用预览

# CustomMouse_EnablePreview_Description
source: Show real-time preview of mouse styles
de: Echtzeitvorschau der Mausstile anzeigen
es: Mostrar vista previa en tiempo real de los estilos de ratón
fr: Afficher l'aperçu en temps réel des styles de souris
ja: マウススタイルのリアルタイムプレビューを表示
ko: 마우스 스타일 실시간 미리보기 표시
ru: Mostrar pré-visualização em tempo real dos estilos de rato
zh_hans: 显示鼠标样式的实时预览

# CustomMouse_AutoApplyOnStartup
source: Auto Apply on Startup
de: Automatisch beim Start anwenden
es: Aplicación Automática al Iniciar
fr: Application Automatique au Démarrage
ja: 起動時に自動適用
ko: 시작 시 자동 적용
ru: Aplicar Automaticamente no Início
zh_hans: 启动时自动应用

# CustomMouse_AutoApplyOnStartup_Description
source: Automatically apply current mouse style when application starts
de: Den aktuellen Mausstil automatisch beim Anwendungsstart anwenden
es: Aplicar automáticamente el estilo de ratón actual al iniciar la aplicación
fr: Appliquer automatiquement le style de souris actuel au démarrage de l'application
ja: アプリケーション起動時に現在設定されているマウススタイルを自動的に適用
ko: 애플리케이션 시작 시 현재 설정된 마우스 스타일을 자동으로 적용
ru: Aplicar automaticamente o estilo de rato atual ao iniciar a aplicação
zh_hans: 应用程序启动时自动应用当前设置的鼠标样式

# CustomMouse_ShowNotifications
source: Show Notifications
de: Benachrichtigungen anzeigen
es: Mostrar Notificaciones
fr: Afficher les Notifications
ja: 通知を表示
ko: 알림 표시
ru: Mostrar Notificações
zh_hans: 显示通知

# CustomMouse_ShowNotifications_Description
source: Show notification messages when mouse style changes
de: Benachrichtigungen bei Mausstiländerungen anzeigen
es: Mostrar mensajes de notificación al cambiar el estilo de ratón
fr: Afficher les messages de notification lors du changement de style de souris
ja: マウススタイル変更時に通知メッセージを表示
ko: 마우스 스타일 변경 시 알림 메시지 표시
ru: Mostrar mensagens de notificação ao alterar o estilo de rato
zh_hans: 在鼠标样式更改时显示通知消息

# CustomMouse_ApplyStyle
source: Apply Style
de: Stil anwenden
es: Aplicar Estilo
fr: Appliquer le Style
ja: スタイルを適用
ko: 스타일 적용
ru: Aplicar Estilo
zh_hans: 应用样式

# CustomMouse_RestoreDefault
source: Restore Default
de: Standard wiederherstellen
es: Restaurar Predeterminado
fr: Restaurer les Paramètres par Défaut
ja: デフォルトに戻す
ko: 기본값 복원
ru: Restaurar Padrão
zh_hans: 恢复默认

# CustomMouse_Refresh
source: Refresh
es: Actualizar
fr: Rafraîchir
ja: 更新
ko: 새로고침
ru: Atualizar
zh_hans: 刷新

# CustomMouse_AvailableStyles
source: Available Styles
de: Verfügbare Stile
es: Estilos Disponibles
fr: Styles Disponibles
ja: 利用可能なスタイル
ko: 사용 가능한 스타일
ru: Estilos Disponíveis
zh_hans: 可用样式

# CustomMouse_NoStylesFound
source: No available mouse styles found
de: Keine verfügbaren Mausstile gefunden
es: No se encontraron estilos de ratón disponibles
fr: Aucun style de souris disponible trouvé
ja: 利用可能なマウススタイルが見つかりません
ko: 사용 가능한 마우스 스타일을 찾을 수 없습니다
ru: Nenhum estilo de rato disponível encontrado
zh_hans: 未找到可用的鼠标样式

# CustomMouse_StyleApplied
source: Mouse style applied
de: Mausstil angewendet
es: Estilo de ratón aplicado
fr: Style de souris appliqué
ja: マウススタイルが適用されました
ko: 마우스 스타일이 적용되었습니다
ru: Estilo de rato aplicado
zh_hans: 鼠标样式已应用

# CustomMouse_StyleRestored
source: Default mouse style restored
de: Standard-Mausstil wiederhergestellt
es: Estilo de ratón predeterminado restaurado
fr: Style de souris par défaut restauré
ja: デフォルトのマウススタイルに復元されました
ko: 기본 마우스 스타일이 복원되었습니다
ru: Estilo de rato padrão restaurado
zh_hans: 已恢复默认鼠标样式

# CustomMouse_ApplyError
source: Error applying mouse style
de: Fehler beim Anwenden des Mausstils
es: Error al aplicar el estilo de ratón
fr: Erreur lors de l'application du style de souris
ja: マウススタイルの適用中にエラーが発生しました
ko: 마우스 스타일 적용 중 오류 발생
ru: Erro ao aplicar o estilo de rato
zh_hans: 应用鼠标样式时发生错误

# CustomMouse_DetectingTheme
source: Detecting theme...
de: Erkennung des Designs...
es: Detectando tema...
fr: Détection du thème...
ja: テーマを検出中...
ko: 테마 감지 중...
ru: A detectar tema...
zh_hans: 正在检测主题...

# CustomMouse_LightThemeDetected
source: Light theme detected
de: Helles Design erkannt
es: Tema claro detectado
fr: Thème clair détecté
ja: ライトテーマが検出されました
ko: 라이트 테마 감지됨
ru: Tema claro detectado
zh_hans: 检测到浅色主题

# CustomMouse_DarkThemeDetected
source: Dark theme detected
de: Dunkles Design erkannt
es: Tema oscuro detectado
fr: Thème sombre détecté
ja: ダークテーマが検出されました
ko: 다크 테마 감지됨
ru: Tema escuro detectado
zh_hans: 检测到深色主题

# CustomMouse_ExtensionMode_Description
source: Extension Mode: Integrate mouse style functionality into the system optimization interface
de: Erweiterungsmodus: Mausstilfunktion in die Systemoptimierungsschnittstelle integrieren
es: Modo de Extensión: Integrar la funcionalidad de estilo de ratón en la interfaz de optimización del sistema
fr: Mode Extension: Intégrer la fonctionnalité de style de souris dans l'interface d'optimisation du système
ja: 拡張モード：マウススタイル機能をシステム最適化インターフェースに統合
ko: 확장 모드: 마우스 스타일 기능을 시스템 최적화 인터페이스에 통합
ru: Modo de Extensão: Integrar a funcionalidade de estilo de rato na interface de otimização do sistema
zh_hans: 扩展模式：将鼠标样式功能集成到系统优化界面中

# CustomMouse_IndependentMode_Description
source: Independent Mode: Provides a dedicated mouse style management interface
de: Unabhängiger Modus: Bietet eine dedizierte Mausstil-Verwaltungsoberfläche
es: Modo Independiente: Proporciona una interfaz dedicada para la gestión de estilos de ratón
fr: Mode Indépendant: Fournit une interface dédiée à la gestion des styles de souris
ja: 独立モード：専用のマウススタイル管理インターフェースを提供
ko: 독립 모드: 전용 마우스 스타일 관리 인터페이스 제공
ru: Modo Independente: Fornece uma interface dedicada para gestão de estilos de rato
zh_hans: 独立模式：提供独立的鼠标样式管理界面

# CustomMouse_ExtensionPage_Title
source: W11-CC-V2.2-HDPI Mouse Style
de: W11-CC-V2.2-HDPI Mausstil
es: Estilo de Mouse W11-CC-V2.2-HDPI
fr: Style de Souris W11-CC-V2.2-HDPI
ja: W11-CC-V2.2-HDPI マウススタイル
ko: W11-CC-V2.2-HDPI 마우스 스타일
ru: Estilo de Mouse W11-CC-V2.2-HDPI
zh_hans: W11-CC-V2.2-HDPI 鼠标样式

# CustomMouse_ExtensionPage_StatusNotApplied
source: Not Applied
de: Nicht angewendet
es: No Aplicado
fr: Non Appliqué
ja: 未適用
ko: 미적용
ru: Não Aplicado
zh_hans: 未应用

# CustomMouse_ExtensionPage_ApplyStyle
source: Apply Style
de: Stil anwenden
es: Aplicar Estilo
fr: Appliquer le Style
ja: スタイルを適用
ko: 스타일 적용
ru: Aplicar Estilo
zh_hans: 应用样式

# CustomMouse_ExtensionPage_RemoveStyle
source: Remove Style
de: Stil entfernen
es: Eliminar Estilo
fr: Supprimer le Style
ja: スタイルを削除
ko: 스타일 제거
ru: Remover Estilo
zh_hans: 移除样式

# CustomMouse_ExtensionPage_FeatureDescription
source: Features:
de: Funktionen:
es: Características:
fr: Fonctionnalités:
ja: 機能:
ko: 기능:
ru: Funcionalidades:
zh_hans: 功能说明:

# CustomMouse_ExtensionPage_Feature1
source: • Windows 11 style HD mouse cursor
de: • Windows 11 Stil HD-Mauszeiger
es: • Cursor de ratón HD estilo Windows 11
fr: • Curseur de souris HD style Windows 11
ja: • Windows 11スタイルのHDマウスカーソル
ko: • Windows 11 스타일 HD 마우스 커서
ru: • Cursor de rato HD estilo Windows 11
zh_hans: • Windows 11风格高清鼠标光标

# CustomMouse_ExtensionPage_Feature2
source: • Automatic light and dark theme switching
de: • Automatischer Wechsel zwischen hellen und dunklen Designs
es: • Cambio automático entre temas claro y oscuro
fr: • Commutation automatique entre thèmes clair et sombre
ja: • ライト/ダークテーマの自動切り替え
ko: • 라이트/다크 테마 자동 전환
ru: • Alternância automática entre temas claro e escuro
zh_hans: • 支持浅色和深色主题自动切换

# CustomMouse_ExtensionPage_Feature3
source: • High DPI display optimization
de: • Optimierung für hohe DPI-Anzeigen
es: • Optimización de pantalla de alta DPI
fr: • Optimisation d'affichage haute DPI
ja: • 高DPI表示最適化
ko: • 고 DPI 표시 최적화
ru: • Otimização de exibição de alta DPI
zh_hans: • 高DPI显示优化

# CustomMouse_ExtensionPage_Feature4
source: • Multiple cursor styles available
de: • Auswahl mehrerer Cursor-Stile
es: • Múltiples estilos de cursor disponibles
fr: • Plusieurs styles de curseur disponibles
ja: • 複数のカーソルスタイルから選択
ko: • 다양한 커서 스타일 선택
ru: • Vários estilos de cursor disponíveis
zh_hans: • 多种光标样式选择

# CustomMouse_SmartSettings
source: Smart Settings
de: Intelligente Einstellungen
es: Configuración Inteligente
fr: Paramètres Intelligents
ja: スマート設定
ko: 스마트 설정
ru: Configurações Inteligentes
zh_hans: 智能设置

# CustomMouse_AdvancedSettings
source: Advanced Settings
de: Erweiterte Einstellungen
es: Configuración Avanzada
fr: Paramètres Avancés
ja: 詳細設定
ko: 고급 설정
ru: Configurações Avançadas
zh_hans: 高级设置

# CustomMouse_DebugInfo
source: Debug Info
de: Debug-Informationen
es: Información de Depuración
fr: Informations de Débogage
ja: デバッグ情報
ko: 디버그 정보
ru: Informações de Depuração
zh_hans: 调试信息

# CustomMouse_CurrentStyleLabel
source: Current Style:
de: Aktueller Stil:
es: Estilo Actual:
fr: Style Actuel:
ja: 現在のスタイル:
ko: 현재 스타일:
ru: Estilo Atual:
zh_hans: 当前样式:

# CustomMouse_ThemeModeLabel
source: Theme Mode:
de: Designmodus:
es: Modo de Tema:
fr: Mode Thème:
ja: テーマモード:
ko: 테마 모드:
ru: Modo de Tema:
zh_hans: 主题模式:

# CustomMouse_PluginModeLabel
source: Plugin Mode:
de: Plugin-Modus:
es: Modo de Plugin:
fr: Mode Plugin:
ja: プラグインモード:
ko: 플러그인 모드:
ru: Modo de Plugin:
zh_hans: 插件模式:

# CustomMouse_LastDetectionLabel
source: Last Detection:
de: Letzte Erkennung:
es: Última Detección:
fr: Dernière Détection:
ja: 最終検出:
ko: 최종 감지:
ru: Última Deteção:
zh_hans: 上次检测:

# CustomMouse_ExtensionModeRadio
source: Extension Mode
de: Erweiterungsmodus
es: Modo de Extensión
fr: Mode Extension
ja: 拡張モード
ko: 확장 모드
ru: Modo de Extensão
zh_hans: 扩展模式

# CustomMouse_IndependentModeRadio
source: Independent Mode
de: Unabhängiger Modus
es: Modo Independiente
fr: Mode Indépendant
ja: 独立モード
ko: 독립 모드
ru: Modo Independente
zh_hans: 独立模式

# CustomMouse_ResetSettings
source: Reset Settings
de: Einstellungen zurücksetzen
es: Restablecer Configuración
fr: Réinitialiser les Paramètres
ja: 設定をリセット
ko: 설정 재설정
ru: Redefinir Configurações
zh_hans: 重置设置

# CustomMouse_SaveSettings
source: Save Settings
de: Einstellungen speichern
es: Guardar Configuración
fr: Enregistrer les Paramètres
ja: 設定を保存
ko: 설정 저장
ru: Guardar Configurações
zh_hans: 保存设置

# CustomMouse_Ready
source: Ready
de: Bereit
es: Listo
fr: Prêt
ja: 準備完了
ko: 준비 완료
ru: Pronto
zh_hans: 就绪

# CustomMouse_ThemeAuto
source: Theme: Auto
de: Design: Automatisch
es: Tema: Automático
fr: Thème: Automatique
ja: テーマ: 自動
ko: 테마: 자동
ru: Tema: Automático
zh_hans: 主题：自动
